<template>
  <main class="about">
    <div class="overview">
      <div class="introduction">
        <h1 class="name">社团介绍</h1>
        <p>HeartBeat心乐社创立于2012年，是潮实高中部的第二批社团之一，也是校内唯一的大型音乐社团。<br></p>
        <p>HeartBeat心乐社是一个充满激情与创造力的社团。我们致力于提供一个平台，让全校的音乐爱好者们能够汇聚一堂，共同学习、交流和分享音乐的魅力。
          <br><br>分部HeartBeat心乐社包含歌手部、乐手部和企划部三个部门。三个部门各司其职，共同组成了HeartBeat心乐社。</p>
        <h1 class="name">部门介绍</h1>
        <ul>
          <li>歌手部：在学校的各类文艺活动中，总能看到歌手部成员活跃的身影。他们积极报名参与，用美妙的歌声传递情感，展现青春的风采。<br>
          <br>
          歌手部注重培养成员的歌唱技巧和舞台表现力。通过定期的内部训练和交流活动，成员们相互学习、共同进步。<br>
          <br>
          这里不仅是热爱歌唱的同学们展现自我的舞台，更是一个充满温暖与鼓励的大家庭。大家为了共同的音乐梦想而不断努力，在一次次的活动中积累经验，不断提升自己的艺术水平。<br>
          <br>
          歌手部的成员们始终保持着对音乐的热爱和执着，用歌声诠释青春的活力与激情，为校园文化生活增添了一抹亮丽的色彩。<br>
          <br>
          </li>
          <li>
          乐手部：乐手部，一个充满活力与激情的集体，现面向高一高二招新。<br>
          <br>
          不论你是钢琴能手、吉他达人，还是鼓击爱好者，我们都欢迎你加入。这里，你将与志同道合的伙伴们共同演绎美妙的音乐，体验创作的喜悦。在乐手部，每一次排练都是成长，每一场演出都是收获。<br>
          <br>
          我们热爱音乐，追求艺术。我们将内心的情感融入音乐，融进每个琴键、每根琴弦，在每声击鼓中流露。<br>
          <br>
          让我们携手，用音符书写青春，用旋律点亮梦想。速来报名，共赴音乐之旅！<br>
            <br>
          </li>
          <li>
          企划部：企划部是心乐社中最丰富的部门，容纳音乐创作、舞台设计、活动策划、视频剪辑、中控、海报制作、概念产出等多项分区。<br>
          <br>
          在企划部中，成员可以尽情发挥长处，为社团发展添砖加瓦。可以为社团活动提出草案；可以为歌手部或乐手部的成员们谱写独具个人特色的原创曲目；也可以为表演或活动制作视频。<br>
          <br>
          当然，企划部不只是“幕后”的部门。企划部成员们依然有机会站上舞台，成为耀眼的光芒。你也能凭借自己的舞台设计博得观众的眼球。而身后的大屏幕打出这首歌的创作者是你本人时，全场都会为你欢呼。<br>
          <br>
          企划部的日常不围着桌子天天开会，而是每个有血有肉的人在交换想法，是不同的灵魂在碰撞。企划部是社团之根，为社团提供养分，同样也能成为心乐社开出的花。<br>
          </li>
        </ul>
      </div>
    </div>
  </main>
</template>

<style scoped>
main {
  margin: 2rem;
}

.logo svg {
  margin: auto;
  border-radius: 50%;
  width: 5rem;
  height: 5rem;
  display: block;
}

.introduction h1,
.introduction i {
  text-align: center;
}

.overview {
  margin: 10vh auto;
  width: 70%;
}

@media screen and (max-width: 700px) {
  main {
    margin: 1rem 0;
  }

  .overview {
    width: 90%;
  }

  .about h1 {
    display: block;
  }
}
</style>
<script setup lang="ts">
</script>